zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4000t.svd
Firmware Rule: Do not program SW_PU and SW_PD such that they are closed simultaneously.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPEN</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOSED</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH2</name>
                    <description>N/A</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0_OR_PH1</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0X</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1X</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0_OR_FS2PH0_AND_PH1_OR_PH3</name>
                    <description>ph0 || [Fs2_ph0 &amp;&amp; (ph1 || ph3)]</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK</name>
                    <description>clk_extfb</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0X_BAR</name>
                    <description>!ph0X</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1_OR_PH2</name>
                    <description>Note SENSE_DUTY_CTL digital non-overlap control has no impact on this waveform.</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0_OR_PH3</name>
                    <description>Note SENSE_DUTY_CTL digital non-overlap control has no impact on this waveform.</description>
                    <value>12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SW_PD</name>
                <description>CMOD4 to vssa_q Switch.

Firmware Rule: Do not program SW_PU and SW_PD such that they are closed simultaneously.</description>
                <bitRange>[27:24]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPEN</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLOSED</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH2</name>
                    <description>N/A</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1_OR_PH3</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH2_OR_PH3</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0X</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1X</name>
                    <description>N/A</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH2_OR_FS2PH1_AND_PH1_OR_PH3</name>
                    <description>ph2 || [Fs2_ph1 &amp;&amp; (ph1 || ph3)]</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK_BAR</name>
                    <description>clk_extfb_bar</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH1_OR_PH2</name>
                    <description>Note SENSE_DUTY_CTL digital non-overlap control has no impact on this waveform.</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PH0_OR_PH3</name>
                    <description>Note SENSE_DUTY_CTL digital non-overlap control has no impact on this waveform.</description>
                    <value>12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REF_MODE</name>
                <description>N/A</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDRV_EN</name>
                <description>N/A</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SNS</name>
          <description>Sensor Configuration Structure (clk_imo_msc domain)</description>
          <addressOffset>0x00002000</addressOffset>
          <register>
            <dim>1024</dim>
            <dimIncrement>4</dimIncrement>
            <name>SENSOR_DATA[%s]</name>
            <description>Sensor Configuration Storage</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Local IP storage to support per-sensor configuration and results for AS-MS/LP-AoS mode. The per sensor registers all have the prefix SNS_* in the SNS_STRUCTLP register tab.

